<h1 align="center">ETL Process for SuperTravel Database</h1>
<h3 align="center">Yuhan Dai (yd2659), Jianjia Liu (jl6242) and Danni Zhang (dz2504)</h3>

### Part 0: Environment Setup

In [1]:
import pandas as pd
import numpy as np
import json

from faker import Faker
import random
from datetime import timedelta

from sqlalchemy import create_engine

## **Plan and Reasoning**

The plan for transforming and loading the data into the SuperTravel database system is designed to ensure data efficiency of use. We plan to use Python to extract and transform the data from different data sources. Then, we will connect to our sql database and load the data from python dataframe into the final schema of the sql database. I will include the reasoning of our decision below:

1.   **Hotel and Car Rental Databases:**

> For the hotel and car rental databases, we have chosen to split the data across two main databases, since there the review table is using a different database. One of the database is used for storing review tables, while the other one handles the rest of the tables.
>
> The data starts in First Normal Form (1NF) in the main dataframe with atomic values and no repeating groups. We then transform this data into the Third Normal Form (3NF) to reduce data redundancy.

2.   **Flight Databases:**

> For the flights, we have adopted a slightly different approach due to the inherent complexity and volume of the data. We have multiple databases including airports, routes, airlines, planes, and airline review databases.
>
> Given the number of different databases, it was not feasible to create a single main dataframe. Instead, we choose to create several smaller dataframes that can be directly fit into our 3NF schema. This approach is more manageable and allows us to better maintain the integrity of each dataset.

3.   **Data Mocking with Faker:**

> We had some data that is not available in the database. In this case, we use the Python library "Faker" to mock data.
>
> We also use Faker to generate data for the user, payments, and bookings tables. This data is crucial for completing the representation of a fully functioning travel booking system but there is no available online due to privacy concerns. Using Faker, we can simulate this data in a way that is representative of the real world, without violating any privacy norms.

### Part 1: Extract and Transform Datasets

#### 1.1 Users

In [2]:
# create UsersInfo database with GroupID
fake = Faker()

def generate_user(i):
    return {
        'UserID': i,
        'FirstName': fake.first_name(),
        'LastName': fake.last_name(),
        'Email': fake.email(),
        'Password': fake.password(),
        'Country': 'United States',
        'PhoneNumber': fake.numerify(text='(###) ###-####'),
        'Address': fake.address().replace('\n', ', '),
        'GroupID': group_ids[i-1]
    }

np.random.seed(0)

group_ids = []
group_id = 1

while len(group_ids) < 30000:
    group_size = np.random.randint(1, 3)
    if len(group_ids) + group_size > 30000:
        group_size = 30000 - len(group_ids)
    group_ids.extend([group_id] * group_size)
    group_id += 1

users_df = pd.DataFrame([generate_user(i+1) for i in range(30000)])
users_df.head()

,UserID,FirstName,LastName,Email,Password,Country,PhoneNumber,Address,GroupID
0,1,Bailey,Stephens,pricerobert@example.com,zHSGAOwD(7,United States,(396) 147-2303,"027 Cantu Lodge Apt. 091, Bakermouth, NV 42652",1
1,2,Kenneth,Harrison,ystrong@example.com,YxkU*P(^$3,United States,(165) 906-5753,"139 Murray Stravenue Apt. 584, Cherrymouth, SD...",2
2,3,Amber,Flores,tiffany82@example.net,c1R2AaPE)v,United States,(411) 310-5021,"9028 Edwards Crest Apt. 722, Chavezbury, WV 14147",2
3,4,Lynn,Anderson,donnagilmore@example.com,84JQrwX($d,United States,(935) 933-0904,"Unit 1545 Box 1487, DPO AE 32598",3
4,5,Bruce,Davidson,cheryljackson@example.net,$(Y9Tt6o5B,United States,(086) 155-3472,"206 Cohen Burg Suite 294, Mckeefurt, TN 27447",3

#### 1.2 Payments

##### Payment Method Dataset

In [3]:
# create Payment Method database
def generate_payment_method(i):
    return {
        'PaymentMethodID': i,
        'UserID': i,
        'CardNumber': fake.credit_card_number(),
        'CardExpiry': fake.date_between(start_date='-5y', end_date='+5y'),
        'CardCVV': fake.credit_card_security_code()
    }

payment_method_df = pd.DataFrame([generate_payment_method(i+1) for i in range(30000)])
payment_method_df.head()

   PaymentMethodID  UserID           CardNumber  CardExpiry CardCVV
0                1       1     3508833699632845  2024-07-18     456
1                2       2  4724988873995674147  2021-09-07     554
2                3       3     4365164050500953  2023-11-07     586
3                4       4  4896828489824650487  2022-05-10     581
4                5       5  4807817602046284964  2023-03-26     375

##### Payments Dataset

In [4]:
# create Payments database
np.random.seed(0)
random_ids = np.random.permutation(np.arange(1, 30001))

def generate_payment(i):
    return {
        'PaymentID': i,
        'BookingID': i,
        'PaymentMethodID': random_ids[i-1],
        'PaymentDate': fake.date_between(start_date='-1y', end_date='today'),
    }

# generate payment for each group
payments_df = pd.DataFrame([generate_payment(i+1) for i in range(len(users_df.GroupID.unique()))])
payments_df.head()

   PaymentID  BookingID  PaymentMethodID PaymentDate
0          1          1             8226  2022-10-29
1          2          2            10795  2022-08-31
2          3          3             9164  2022-09-30
3          4          4            26592  2023-05-12
4          5          5             6632  2023-06-17

#### 1.3 Bookings

In [5]:
# create Bookings database
bookings_df = pd.DataFrame({
    'BookingID': payments_df.BookingID,
    'UserID': payments_df.PaymentMethodID,
    'BookingDate': [fake.date_between(start_date='-1y', end_date='today') for i in range(len(payments_df.BookingID))]
})

# Display the DataFrame
bookings_df.head()

   BookingID  UserID BookingDate
0          1    8226  2022-08-17
1          2   10795  2023-01-17
2          3    9164  2023-05-31
3          4   26592  2022-09-10
4          5    6632  2022-09-04

#### 1.4 Flights

##### Airport Dataset

In [6]:
# read Airport database
airport_df = pd.read_csv('airports.dat', header=None)
airport_df.columns = ['AirportID', 'Name', 'City', 'Country', 'IATA', 'ICAO', 'Latitude', 'Longitude', 'Altitude', 'Timezone', 'DST', 'Tz database time zone', 'Type', 'Source']
airport_df.head()

,AirportID,Name,City,Country,IATA,ICAO,Latitude,Longitude,Altitude,Timezone,DST,Tz database time zone,Type,Source
0,1,Goroka Airport,Goroka,Papua New Guinea,GKA,AYGA,-6.081690,145.391998,5282,10,U,Pacific/Port_Moresby,airport,OurAirports
1,2,Madang Airport,Madang,Papua New Guinea,MAG,AYMD,-5.207080,145.789001,20,10,U,Pacific/Port_Moresby,airport,OurAirports
2,3,Mount Hagen Kagamuga Airport,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826790,144.296005,5388,10,U,Pacific/Port_Moresby,airport,OurAirports
3,4,Nadzab Airport,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569803,146.725977,239,10,U,Pacific/Port_Moresby,airport,OurAirports
4,5,Port Moresby Jacksons International Airport,Port Moresby,Papua New Guinea,POM,AYPY,-9.443380,147.220001,146,10,U,Pacific/Port_Moresby,airport,OurAirports

In [7]:
# drop missing value for Airport database

# replace missing value string with NaN object
airport_df.replace(['\\N'], pd.NA, inplace=True)
# drop missing values
airport_df.dropna(subset=['IATA', 'Name', 'City', 'Country'], inplace=True)

airport_df.head()

,AirportID,Name,City,Country,IATA,ICAO,Latitude,Longitude,Altitude,Timezone,DST,Tz database time zone,Type,Source
0,1,Goroka Airport,Goroka,Papua New Guinea,GKA,AYGA,-6.081690,145.391998,5282,10,U,Pacific/Port_Moresby,airport,OurAirports
1,2,Madang Airport,Madang,Papua New Guinea,MAG,AYMD,-5.207080,145.789001,20,10,U,Pacific/Port_Moresby,airport,OurAirports
2,3,Mount Hagen Kagamuga Airport,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826790,144.296005,5388,10,U,Pacific/Port_Moresby,airport,OurAirports
3,4,Nadzab Airport,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569803,146.725977,239,10,U,Pacific/Port_Moresby,airport,OurAirports
4,5,Port Moresby Jacksons International Airport,Port Moresby,Papua New Guinea,POM,AYPY,-9.443380,147.220001,146,10,U,Pacific/Port_Moresby,airport,OurAirports

##### Airline Dataset

In [8]:
# read Airline database
airline_df = pd.read_csv('airlines.dat', header=None)
airline_df.columns = ['AirlineID', 'Name', 'Alias', 'IATA', 'ICAO', 'Callsign', 'Country', 'Active']
airline_df.head()

,AirlineID,Name,Alias,IATA,ICAO,Callsign,Country,Active
0,-1,Unknown,\N,-,NaN,\N,\N,Y
1,1,Private flight,\N,-,NaN,NaN,NaN,Y
2,2,135 Airways,\N,NaN,GNL,GENERAL,United States,N
3,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
4,4,2 Sqn No 1 Elementary Flying Training School,\N,NaN,WYT,NaN,United Kingdom,N

In [9]:
# drop missing value for Airline database

# replace missing value strings with NaN object
airline_df.replace(['NaN', 'N/A', '\\N', '-', 'nan'], pd.NA, inplace=True)
# drop missing values
airline_df.dropna(subset=['AirlineID', 'Name', 'Country'], inplace=True)

airline_df.head()

,AirlineID,Name,Alias,IATA,ICAO,Callsign,Country,Active
2,2,135 Airways,<NA>,NaN,GNL,GENERAL,United States,N
3,3,1Time Airline,<NA>,1T,RNX,NEXTIME,South Africa,Y
4,4,2 Sqn No 1 Elementary Flying Training School,<NA>,NaN,WYT,NaN,United Kingdom,N
5,5,213 Flight Unit,<NA>,NaN,TFU,NaN,Russia,N
6,6,223 Flight Unit State Airline,<NA>,NaN,CHD,CHKALOVSK-AVIA,Russia,N

##### Aircraft Dataset

In [10]:
# read Plane database
plane_df = pd.read_csv('planes.dat', header=None)
plane_df.columns = ['Name', 'IATA', 'ICAO']
plane_df.head()

                                           Name IATA  ICAO
0                       Aerospatiale (Nord) 262  ND2  N262
1  Aerospatiale (Sud Aviation) Se.210 Caravelle  CRV  S210
2                  Aerospatiale SN.601 Corvette  NDC  S601
3                Aerospatiale/Alenia ATR 42-300  AT4  AT43
4                Aerospatiale/Alenia ATR 42-500  AT5  AT45

In [11]:
# drop missing value for Plane database

# replace missing value strings with NaN object
plane_df.replace(['NaN', 'N/A', '\\N', '-', 'nan'], pd.NA, inplace=True)
# drop missing values
plane_df.dropna(subset=['IATA', 'Name'], inplace=True)

plane_df.head()

                                           Name IATA  ICAO
0                       Aerospatiale (Nord) 262  ND2  N262
1  Aerospatiale (Sud Aviation) Se.210 Caravelle  CRV  S210
2                  Aerospatiale SN.601 Corvette  NDC  S601
3                Aerospatiale/Alenia ATR 42-300  AT4  AT43
4                Aerospatiale/Alenia ATR 42-500  AT5  AT45

In [12]:
# split Name column into Manufacturer and Model columns
plane_df[['Manufacturer','Model']] = plane_df['Name'].str.split(' ', n=1, expand=True)
plane_df.head()

,Name,IATA,ICAO,Manufacturer,Model
0,Aerospatiale (Nord) 262,ND2,N262,Aerospatiale,(Nord) 262
1,Aerospatiale (Sud Aviation) Se.210 Caravelle,CRV,S210,Aerospatiale,(Sud Aviation) Se.210 Caravelle
2,Aerospatiale SN.601 Corvette,NDC,S601,Aerospatiale,SN.601 Corvette
3,Aerospatiale/Alenia ATR 42-300,AT4,AT43,Aerospatiale/Alenia,ATR 42-300
4,Aerospatiale/Alenia ATR 42-500,AT5,AT45,Aerospatiale/Alenia,ATR 42-500

In [13]:
# generate fake capacity
plane_df = plane_df.assign(Capacity=[fake.random_int(min=50, max=300) for _ in range(len(plane_df))])
plane_df.head()

,Name,IATA,ICAO,Manufacturer,Model,Capacity
0,Aerospatiale (Nord) 262,ND2,N262,Aerospatiale,(Nord) 262,186
1,Aerospatiale (Sud Aviation) Se.210 Caravelle,CRV,S210,Aerospatiale,(Sud Aviation) Se.210 Caravelle,92
2,Aerospatiale SN.601 Corvette,NDC,S601,Aerospatiale,SN.601 Corvette,249
3,Aerospatiale/Alenia ATR 42-300,AT4,AT43,Aerospatiale/Alenia,ATR 42-300,177
4,Aerospatiale/Alenia ATR 42-500,AT5,AT45,Aerospatiale/Alenia,ATR 42-500,259

##### Flight Review Dataset

In [14]:
# read Airline Review database
airline_review_df = pd.read_excel('capstone_airline_reviews3.xlsx')
airline_review_df.head()

,airline,overall,author,review_date,customer_review,aircraft,traveller_type,cabin,route,date_flown,seat_comfort,cabin_service,food_bev,entertainment,ground_service,value_for_money,recommended
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Turkish Airlines,7.0,Christopher Hackley,8th May 2019,âœ… Trip Verified | London to Izmir via Istanb...,NaN,Business,Economy Class,London to Izmir via Istanbul,2019-05-01 00:00:00,4.0,5.0,4.0,4.0,2.0,4.0,yes
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Turkish Airlines,2.0,Adriana Pisoi,7th May 2019,âœ… Trip Verified | Istanbul to Bucharest. We ...,NaN,Family Leisure,Economy Class,Istanbul to Bucharest,2019-05-01 00:00:00,4.0,1.0,1.0,1.0,1.0,1.0,no
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [15]:
# drop missing value for Airline Review database

# replace missing value strings with NaN object
airline_review_df.replace(['NaN'], pd.NA, inplace=True)
# drop missing values
airline_review_df.dropna(subset=['customer_review', 'overall'], inplace=True)

airline_review_df.head()

,airline,overall,author,review_date,customer_review,aircraft,traveller_type,cabin,route,date_flown,seat_comfort,cabin_service,food_bev,entertainment,ground_service,value_for_money,recommended
1,Turkish Airlines,7.0,Christopher Hackley,8th May 2019,âœ… Trip Verified | London to Izmir via Istanb...,NaN,Business,Economy Class,London to Izmir via Istanbul,2019-05-01 00:00:00,4.0,5.0,4.0,4.0,2.0,4.0,yes
3,Turkish Airlines,2.0,Adriana Pisoi,7th May 2019,âœ… Trip Verified | Istanbul to Bucharest. We ...,NaN,Family Leisure,Economy Class,Istanbul to Bucharest,2019-05-01 00:00:00,4.0,1.0,1.0,1.0,1.0,1.0,no
5,Turkish Airlines,3.0,M Galerko,7th May 2019,âœ… Trip Verified | Rome to Prishtina via Ista...,NaN,Business,Economy Class,Rome to Prishtina via Istanbul,2019-05-01 00:00:00,1.0,4.0,1.0,3.0,1.0,2.0,no
7,Turkish Airlines,10.0,Zeshan Shah,6th May 2019,âœ… Trip Verified | Flew on Turkish Airlines I...,A330,Solo Leisure,Economy Class,Washington Dulles to Karachi,April 2019,4.0,5.0,5.0,5.0,5.0,5.0,yes
9,Turkish Airlines,1.0,Pooja Jain,6th May 2019,âœ… Trip Verified | Mumbai to Dublin via Istan...,NaN,Solo Leisure,Economy Class,Mumbai to Dublin via Istanbul,2019-05-01 00:00:00,1.0,1.0,1.0,1.0,1.0,1.0,no

In [16]:
# extract the reviews

# Remove text before and including '|' in 'customer_review' column and remove the first sentence after '|'
airline_review_df['customer_review'] = airline_review_df['customer_review'].str.split('|').str[1].str.split('.').str[1:]
# Convert list of strings back to single string
airline_review_df['customer_review'] = airline_review_df['customer_review'].str.join('.')

airline_review_df.head()

,airline,overall,author,review_date,customer_review,aircraft,traveller_type,cabin,route,date_flown,seat_comfort,cabin_service,food_bev,entertainment,ground_service,value_for_money,recommended
1,Turkish Airlines,7.0,Christopher Hackley,8th May 2019,First time Iâ€™d flown TK. I found them very ...,NaN,Business,Economy Class,London to Izmir via Istanbul,2019-05-01 00:00:00,4.0,5.0,4.0,4.0,2.0,4.0,yes
3,Turkish Airlines,2.0,Adriana Pisoi,7th May 2019,"We make our check in in the airport, they Tak...",NaN,Family Leisure,Economy Class,Istanbul to Bucharest,2019-05-01 00:00:00,4.0,1.0,1.0,1.0,1.0,1.0,no
5,Turkish Airlines,3.0,M Galerko,7th May 2019,I flew with this company several times in the...,NaN,Business,Economy Class,Rome to Prishtina via Istanbul,2019-05-01 00:00:00,1.0,4.0,1.0,3.0,1.0,2.0,no
7,Turkish Airlines,10.0,Zeshan Shah,6th May 2019,Turkish Airlines has consistently maintained ...,A330,Solo Leisure,Economy Class,Washington Dulles to Karachi,April 2019,4.0,5.0,5.0,5.0,5.0,5.0,yes
9,Turkish Airlines,1.0,Pooja Jain,6th May 2019,Never book Turkish airlines if you are travel...,NaN,Solo Leisure,Economy Class,Mumbai to Dublin via Istanbul,2019-05-01 00:00:00,1.0,1.0,1.0,1.0,1.0,1.0,no

In [17]:
# define the number of reviews
num_reviews = len(airline_review_df)

# create a FlightReviews df
flight_reviews_df = pd.DataFrame({
    'ReviewID': np.arange(1, num_reviews + 1),
    'FlightID': np.random.randint(1, 5000, num_reviews),
    'UserID': np.random.randint(1, 30000, num_reviews),
    'Rating': airline_review_df['overall'],
    'Comment': airline_review_df['customer_review']
})

# Display the first few rows of the DataFrame
flight_reviews_df.head()

,ReviewID,FlightID,UserID,Rating,Comment
1,1,2969,12698,7.0,First time Iâ€™d flown TK. I found them very ...
3,2,3897,10682,2.0,"We make our check in in the airport, they Tak..."
5,3,923,29098,3.0,I flew with this company several times in the...
7,4,1129,616,10.0,Turkish Airlines has consistently maintained ...
9,5,3829,19892,1.0,Never book Turkish airlines if you are travel...

##### Class Dataset

In [18]:
# create class database
unique_classes = airline_review_df['cabin'].dropna().unique()

def generate_class(i):
    return {
        'ClassID': i+1,
        'ClassName': unique_classes[i]
    }

class_df = pd.DataFrame([generate_class(i) for i in range(len(unique_classes))])

class_df

   ClassID        ClassName
0        1    Economy Class
1        2   Business Class
2        3  Premium Economy
3        4      First Class

##### Seat Dataset

In [19]:
# create seat database
def generate_seat(i):
    return {
        'SeatID': i,
        'ClassID': fake.random_element(elements=class_df['ClassID'].tolist()),
        'AircraftID': fake.random_element(elements=plane_df['IATA'].tolist()),
        'Price': round(np.random.uniform(50, 500), 2),
        'RowNumber': fake.random_int(min=1, max=30),
        'SeatColumn': fake.random_element(elements=('A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'J', 'K'))
    }

seat_df = pd.DataFrame()

while len(seat_df) < len(bookings_df):
    temp_df = pd.DataFrame([generate_seat(i+1) for i in range(len(bookings_df))])
    temp_df['UniqueSeat'] = temp_df['AircraftID'] + temp_df['RowNumber'].astype(str) + temp_df['SeatColumn']
    temp_df = temp_df.drop_duplicates(subset=['UniqueSeat'])
    seat_df = pd.concat([seat_df, temp_df])
    seat_df = seat_df.drop_duplicates(subset=['UniqueSeat'])

seat_df = seat_df.drop(columns=['UniqueSeat'])
seat_df.head()

   SeatID  ClassID AircraftID   Price  RowNumber SeatColumn
0       1        2        IL6  303.81         19          G
1       2        2        PL6  452.13         15          H
2       3        2        E7W  346.17         25          K
3       4        2        E7W  156.46         30          F
4       5        1        AR1  361.83          6          H

##### Flight Info Dataset

In [20]:
# read Route database
route_df = pd.read_csv('routes.dat', header=None)
route_df.columns = ['Airline', 'AirlineID', 'Source airport', 'Source airport ID', 'Destination airport', 'Destination airport ID', 'Codeshare', 'Stops', 'Equipment']
route_df.head()

,Airline,AirlineID,Source airport,Source airport ID,Destination airport,Destination airport ID,Codeshare,Stops,Equipment
0,2B,410,AER,2965,KZN,2990,NaN,0,CR2
1,2B,410,ASF,2966,KZN,2990,NaN,0,CR2
2,2B,410,ASF,2966,MRV,2962,NaN,0,CR2
3,2B,410,CEK,2968,KZN,2990,NaN,0,CR2
4,2B,410,CEK,2968,OVB,4078,NaN,0,CR2

In [21]:
# drop missing value for Route database

# replace missing value strings with NaN object
route_df.replace(['NaN', 'N/A', '\\N', '-', 'nan'], pd.NA, inplace=True)
# drop missing values
route_df.dropna(subset=['AirlineID', 'Source airport', 'Destination airport'], inplace=True)

route_df.head()

,Airline,AirlineID,Source airport,Source airport ID,Destination airport,Destination airport ID,Codeshare,Stops,Equipment
0,2B,410,AER,2965,KZN,2990,NaN,0,CR2
1,2B,410,ASF,2966,KZN,2990,NaN,0,CR2
2,2B,410,ASF,2966,MRV,2962,NaN,0,CR2
3,2B,410,CEK,2968,KZN,2990,NaN,0,CR2
4,2B,410,CEK,2968,OVB,4078,NaN,0,CR2

In [22]:
# create FlightInfo database
def generate_flight(i):
    departure_time = fake.date_time_between(start_date='-1y', end_date='now')
    arrival_time = departure_time + timedelta(hours=np.random.uniform(1, 15))  # flight duration between 1 and 15 hours
    return {
        'FlightID': i,
        'AirlineID': fake.random_element(elements=route_df['AirlineID'].tolist()),
        'OriginAirportCode': fake.random_element(elements=route_df['Source airport'].tolist()),
        'DestinationAirportCode': fake.random_element(elements=route_df['Destination airport'].tolist()),
        'AircraftID': fake.random_element(elements=plane_df['IATA'].tolist()),
        'DepartureTime': departure_time,
        'ArrivalTime': arrival_time
    }

flight_info_df = pd.DataFrame([generate_flight(i+1) for i in range(len(bookings_df))])
flight_info_df['ArrivalTime'] = flight_info_df['ArrivalTime'].dt.floor('S')  # round ArrivalTime
flight_info_df.head()

,FlightID,AirlineID,OriginAirportCode,DestinationAirportCode,AircraftID,DepartureTime,ArrivalTime
0,1,751,DYU,DBV,320,2023-07-31 12:56:02,2023-07-31 15:42:22
1,2,3437,ARN,ORD,333,2023-06-05 16:50:22,2023-06-06 07:27:13
2,3,1889,LPB,OGG,295,2022-10-30 17:50:23,2022-10-31 04:20:31
3,4,4936,BSB,EMA,SH6,2022-08-19 02:27:38,2022-08-19 08:44:29
4,5,4091,CAE,KOO,74J,2022-10-14 15:46:07,2022-10-15 04:51:51

##### Flight Bookings Dataset

In [23]:
# create FlightBookings database
unique_pairs = set()
flight_bookings_data = []

for i in range(15000):
    booking_id = fake.random_int(min=1, max=len(bookings_df))
    flight_id = fake.random_int(min=1, max=max(flight_info_df.FlightID))
    pair = (booking_id, flight_id)

    # check if the pair is unique
    while pair in unique_pairs:
        booking_id = fake.random_int(min=1, max=len(bookings_df))
        flight_id = fake.random_int(min=1, max=max(flight_info_df.FlightID))
        pair = (booking_id, flight_id)

    # add the unique pair to the set
    unique_pairs.add(pair)

    aircraft_id = flight_info_df.loc[flight_info_df['FlightID'] == flight_id, 'AircraftID'].values[0]
    seat_ids = seat_df.loc[seat_df['AircraftID'] == aircraft_id, 'SeatID']

    # no seats for this aircraft, continue
    if seat_ids.empty:
        continue

    seat_id = seat_ids.sample(n=1).values[0]
    flight_bookings_data.append({
        'BookingID': booking_id,
        'FlightID': flight_id,
        'SeatID': seat_id
    })

flight_bookings_df = pd.DataFrame(flight_bookings_data)

flight_bookings_df.head()

   BookingID  FlightID  SeatID
0      13903     14061    2654
1      17403      5393     239
2      12909     19774   11657
3       9649     19907    3610
4      12214      1143    6746

In [24]:
# search the price of the seat
merged_df = flight_bookings_df.merge(seat_df[['SeatID', 'Price']], on='SeatID', how='left')
# calculate the total price of each booking id
flight_bookingid_total_df = merged_df.groupby('BookingID')['Price'].sum().reset_index()

flight_bookingid_total_df.columns = ['BookingID', 'TotalAmount']
flight_bookingid_total_df.head()

   BookingID  TotalAmount
0          1       457.96
1          2       672.78
2          3       553.80
3          5       720.69
4          6       592.03

#### 1.5 Hotels

##### Hotel Reviews Dataset

In [25]:
# Hotel Review Dataset
hotel_reviews = 'tripadvisor_hotel_reviews.csv'
hotelreviews_df = pd.read_csv(hotel_reviews)

In [26]:
# Function to generate fake hotel reviews data
def generate_hotel_reviews_data(num_reviews, num_hotels):
    fake = Faker()
    hotel_ids = [fake.random_int(min=1, max=1000) for _ in range(num_hotels)]
    ratings = [random.randint(1, 5) for _ in range(num_reviews)]

    data = {
        'ReviewID': [i + 1 for i in range(num_reviews)],
        'UserID': [random.randint(1, 30000) for _ in range(num_reviews)],
        'HotelID': [random.choice(hotel_ids) for _ in range(num_reviews)],
        'Rating': ratings,
        'Comment': [fake.paragraph() for _ in range(num_reviews)]
    }

    return data

# Generate fake hotel reviews with 1000 hotels
num_reviews = len(hotelreviews_df)
num_hotels = 1000
reviews_data = generate_hotel_reviews_data(num_reviews, num_hotels)

# Create a df from fake data
hotel_reviews_df = pd.DataFrame(reviews_data)

# Select the "Review" and "Rating" columns from the new df
tripadvisor_reviews = hotelreviews_df[['Review', 'Rating']]

# Update the "comment" and "rating" columns in the previously generated df
hotel_reviews_df['Comment'] = tripadvisor_reviews['Review']
hotel_reviews_df['Rating'] = tripadvisor_reviews['Rating']

hotel_reviews_df.head()

,ReviewID,UserID,HotelID,Rating,Comment
0,1,19157,381,4,nice hotel expensive parking got good deal sta...
1,2,13700,859,2,ok nothing special charge diamond member hilto...
2,3,3804,698,3,nice rooms not 4* experience hotel monaco seat...
3,4,24786,519,5,"unique, great stay, wonderful time hotel monac..."
4,5,24662,768,5,"great stay great stay, went seahawk game aweso..."

##### Hotel Bookings Dataset

In [27]:
# Hotel Databse
import pandas as pd
csv_path = 'hotel_bookings.csv'
hotelbookings_df = pd.read_csv(csv_path)

In [28]:
# Change arrival_date_month to number
# Define a dictionary to map months to numbers
month_to_number = {
    'January': 1,
    'February': 2,
    'March': 3,
    'April': 4,
    'May': 5,
    'June': 6,
    'July': 7,
    'August': 8,
    'September': 9,
    'October': 10,
    'November': 11,
    'December': 12
}

# Apply the mapping to the 'arrival_date_month' column
hotelbookings_df['arrival_date_month'] = hotelbookings_df['arrival_date_month'].map(month_to_number)

In [29]:
# Create a df with specific columns from the "hotel_bookings_df" dataset
columns_to_use = ['arrival_date_year', 'arrival_date_month', 'arrival_date_day_of_month']
existing_data_df = hotelbookings_df[columns_to_use].copy()

# Combine the columns to form the check-in date
existing_data_df['CheckInDate'] = existing_data_df.apply(lambda row: pd.Timestamp(row['arrival_date_year'], row['arrival_date_month'], row['arrival_date_day_of_month']), axis=1)

# Drop the individual date columns as they are no longer needed
existing_data_df.drop(columns=columns_to_use, inplace=True)

In [30]:
# Function to generate fake hotel bookings data
def generate_hotel_bookings_data(num_records):
    fake = Faker()
    booking_ids = [fake.random_int(min=1, max=len(bookings_df)) for _ in range(num_records)]
    room_ids = [fake.random_int(min=1, max=20000) for _ in range(num_records)]
    check_in_dates = existing_data_df['CheckInDate']
    check_out_dates = [check_in_date + timedelta(days=random.randint(0,30)) for check_in_date in check_in_dates]
    return booking_ids, room_ids, check_out_dates

num_records = len(existing_data_df)

# Generate fake data
booking_ids, room_ids, check_out_dates = generate_hotel_bookings_data(num_records)

# Create a df with fake data
fake_data_df = pd.DataFrame({
    'BookingID': booking_ids,
    'RoomID': room_ids,
    'CheckOutDate': check_out_dates
})


# Combine the fake data df and the existing data df
hotel_bookings_df = pd.concat([fake_data_df, existing_data_df], axis=1)

# Limit the booking length with 15000
hotel_bookings_df = hotel_bookings_df.iloc[:15000]
hotel_bookings_df.tail()

       BookingID  RoomID CheckOutDate CheckInDate
14995       7189    5986   2015-07-28  2015-07-15
14996       3693    7773   2015-09-10  2015-09-03
14997       1830   19570   2015-09-19  2015-09-03
14998      19719    2477   2015-09-05  2015-09-03
14999       1046    8082   2015-09-08  2015-09-03

##### Hotel Info Dataset

In [31]:
# HotelInfo dataset

# Function to generate fake hotel information data
def generate_hotels_info_data(num_hotels, hotel_bookings_df):
    fake = Faker()
    room_ids = range(1, 20001)
    hotel_ids = random.sample(range(1, num_hotels + 1), num_hotels)
    country_list = hotelbookings_df['country'].unique()
    star_ratings = [fake.random_int(min=0, max=5) for _ in range(num_hotels)]
    prices_per_night = [fake.random_int(min=50, max=500) for _ in range(num_hotels)]

    data = {
        'HotelID': hotel_ids,
        'HotelName': [fake.company() for _ in range(num_hotels)],
        'City': [fake.city() for _ in range(num_hotels)],
        'Country': [random.choice(country_list) for _ in range(num_hotels)],
        'StarRating': star_ratings,
        'PricePerNight': prices_per_night
    }

    return data

# Generate 1000 fake hotels info
num_hotels = 1000
hotels_info_data = generate_hotels_info_data(num_hotels, hotel_bookings_df)

hotels_info_df = pd.DataFrame(hotels_info_data)

hotels_info_df.head()

,HotelID,HotelName,City,Country,StarRating,PricePerNight
0,886,Vasquez-Lambert,North Kathleenborough,KWT,3,451
1,451,"Burns, Bryant and Zimmerman",Greerland,MLI,2,472
2,572,Campos and Sons,Michaelhaven,DNK,1,423
3,790,Jones-Freeman,East Karen,BIH,1,99
4,984,Roach-Tucker,North Vincent,MCO,4,311

##### Hotel Room Dataset

In [32]:
# Hotel Room dataset

# Function to generate fake hotel room data
def generate_hotel_room_data(num_records):
    fake = Faker()
    room_ids = list(range(1, num_records + 1))
    hotel_ids = [fake.random_int(min=1, max=1000) for _ in range(num_records)]
    max_floors = 30
    max_rooms_per_floor = 20
    floor_numbers = [fake.random_int(min=1, max=max_floors) for _ in range(num_records)]
    room_numbers = [fake.random_int(min=1, max=max_rooms_per_floor) for _ in range(num_records)]
    room_numbers = [floor * 100 + room for floor, room in zip(floor_numbers, room_numbers)]
    occupancy = [fake.random_element(elements=(0, 1)) for _ in range(num_records)]
    room_type = [fake.random_element(elements=("Single", "Double", "Suite", "Deluxe")) for _ in range(num_records)]
    footprint = [fake.random_int(min=200, max=1000) for _ in range(num_records)]  # Square feet
    note = [fake.text(max_nb_chars=200) for _ in range(num_records)]
    return room_ids, hotel_ids, room_numbers, occupancy, floor_numbers, room_type, footprint, note

num_records = 20000  # Set the number of records you want to generate

# Generate fake data for hotelroom table
room_ids, hotel_ids, room_numbers, occupancy, floor, room_type, footprint, note = generate_hotel_room_data(num_records)

# Create a DataFrame with the generated data
hotel_room_df = pd.DataFrame({
    'RoomID': room_ids,
    'HotelID': hotel_ids,
    'RoomNumber': room_numbers,
    'Occupancy': occupancy,
    'Floor': floor,
    'RoomType': room_type,
    'Footprint': footprint,
    'Note': note
})

hotel_room_df.head()

,RoomID,HotelID,RoomNumber,Occupancy,Floor,RoomType,Footprint,Note
0,1,755,1706,1,17,Single,345,Plan lot own nor. Above simple certain more by...
1,2,589,1614,0,16,Suite,828,However determine any his read ready security....
2,3,379,2905,1,29,Double,778,When head world common knowledge certainly ind...
3,4,363,703,1,7,Suite,710,College group heart all fly ability. Beyond gi...
4,5,563,711,0,7,Single,795,Fall recent note act claim. Sign rate chair in...

In [33]:
merged_df = hotel_room_df.merge(hotels_info_df[['HotelID', 'PricePerNight']], on='HotelID')

merged_df = merged_df.merge(hotel_bookings_df[['RoomID', 'BookingID', 'CheckInDate', 'CheckOutDate']], left_on='RoomID', right_on='RoomID')

merged_df['duration'] = (merged_df['CheckOutDate'] - merged_df['CheckInDate']).dt.days
merged_df['TotalAmount'] = merged_df['duration'] * merged_df['PricePerNight']

hotel_bookingid_total_df = merged_df.groupby('BookingID')['TotalAmount'].sum().reset_index()

hotel_bookingid_total_df.head()

   BookingID  TotalAmount
0          4         1008
1          5        13100
2          6         1386
3          8        13057
4          9         2145

#### 1.6 Car Rentals

##### Car Rental Dataset

In [34]:
# load the car rental rate dataset
with open('car.json', 'r') as json_file:
    car = json.load(json_file)

In [35]:
average_daily_prices = []
cities = []
countries = []
car_ids = []
manufacturers = []
models = []
years = []
auto_transmissions = []


# Iterate through each JSON object in the list
for obj in car:
    # Extract the desired fields from the JSON object
    average_daily_price = obj.get('rate', {}).get('averageDailyPrice', None)
    city = obj.get('location', {}).get('city', None)
    country = obj.get('location', {}).get('country', None)
    car_id = obj.get('vehicle', {}).get('id', None)
    manufacturer = obj.get('vehicle', {}).get('make', None)
    model = obj.get('vehicle', {}).get('model', None)
    year = obj.get('vehicle', {}).get('year', None)
    auto_transmission = obj.get('vehicle', {}).get('automaticTransmission', None)

    # Append the extracted values to their respective lists
    average_daily_prices.append(average_daily_price)
    cities.append(city)
    countries.append(country)
    car_ids.append(car_id)
    manufacturers.append(manufacturer)
    models.append(model)
    years.append(year)
    auto_transmissions.append(auto_transmission)

In [36]:
# Create 1NF DataFrame
car_rental_df = pd.DataFrame({
    'CarID': car_ids,
    'CarModel': models,
    'CarManufacture': manufacturers,
    'AutoTrans': auto_transmissions,
    'PricePerDay': average_daily_prices,
    'City': cities,
    'Country': countries
})

# Since there are limited information and open dataset related to car rental companies, we use the Faker library in Python to generate mock data
fake = Faker()

# Generate a list of random company names
num_companies = 3500
temp_company_names = [fake.company() for _ in range(num_companies)]

# Create a list of company names with some duplicates
num_rows = len(car_rental_df)
company_names = random.choices(temp_company_names, k=num_rows)
car_rental_df['CompanyName'] = company_names

# We also use Faker libarary to mock pick-up date, drop-off date, rating & comment data
pick_up_dates = [fake.date_between(start_date='-30d', end_date='-1d') for _ in range(len(car_rental_df))]
drop_off_dates = [fake.date_between(start_date=pick_up_date, end_date='-1d') for pick_up_date in pick_up_dates]

car_rental_df['PickUpDate'] = pick_up_dates
car_rental_df['DropOffDate'] = drop_off_dates

car_rental_df.head()

,CarID,CarModel,CarManufacture,AutoTrans,PricePerDay,City,Country,CompanyName,PickUpDate,DropOffDate
0,58905,Fusion,Ford,True,29.0,Iowa Falls,US,Colon-Campbell,2023-07-09,2023-07-19
1,403202,718 Boxster,Porsche,True,162.0,Marshall,US,"Sanchez, Miller and Proctor",2023-07-29,2023-08-01
2,320436,Cruze,Chevrolet,True,40.0,Colliers,US,Anderson-Hughes,2023-07-07,2023-08-03
3,350460,6 Series,BMW,True,99.0,Moon,US,Oliver-Allen,2023-07-28,2023-08-02
4,429146,Explorer,Ford,True,81.0,Pittsburgh,US,"Aguilar, Underwood and Rodriguez",2023-07-20,2023-07-29

In [37]:
# Check null in the DataFrame
car_rental_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36279 entries, 0 to 36278
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   CarID           36279 non-null  int64
 1   CarModel        36279 non-null  object
 2   CarManufacture  36279 non-null  object
 3   AutoTrans       36279 non-null  bool
 4   PricePerDay     36279 non-null  float64
 5   City            36279 non-null  object
 6   Country         36279 non-null  object
 7   CompanyName     36279 non-null  object
 8   PickUpDate      36279 non-null  object
 9   DropOffDate     36279 non-null  object
dtypes: bool(1), float64(1), int64(1), object(7)
memory usage: 2.5+ MB

In [38]:
# We also Faker libarary to mock pick-up date and drop-off date data, the rental date is within the month
pick_up_dates = [fake.date_between(start_date='-30d', end_date='-1d') for _ in range(len(car_rental_df))]
drop_off_dates = [fake.date_between(start_date=pick_up_date, end_date='-1d') for pick_up_date in pick_up_dates]

car_rental_df['PickUpDate'] = pick_up_dates
car_rental_df['DropOffDate'] = drop_off_dates

car_rental_df.head()

,CarID,CarModel,CarManufacture,AutoTrans,PricePerDay,City,Country,CompanyName,PickUpDate,DropOffDate
0,58905,Fusion,Ford,True,29.0,Iowa Falls,US,Colon-Campbell,2023-07-07,2023-07-16
1,403202,718 Boxster,Porsche,True,162.0,Marshall,US,"Sanchez, Miller and Proctor",2023-07-11,2023-07-16
2,320436,Cruze,Chevrolet,True,40.0,Colliers,US,Anderson-Hughes,2023-08-03,2023-08-03
3,350460,6 Series,BMW,True,99.0,Moon,US,Oliver-Allen,2023-07-31,2023-07-31
4,429146,Explorer,Ford,True,81.0,Pittsburgh,US,"Aguilar, Underwood and Rodriguez",2023-07-09,2023-07-16

In [39]:
# Since the dataset does not have BookingID,
# we mock these columns by random values from the Bookings DataFrame

# Build a funciton to generate random BookingIDs from the Bookings Dataframe
def generate_booking_id():
    return fake.random_int(min=1, max=len(bookings_df))

# Insert a BookingID column to the car_rental_df
# We ensure there are no duplicate value pairs of CarID and BookingID
booking_ids = []
used_pairs = set()

for _, row in car_rental_df.iterrows():
    car_id = row['CarID']
    booking_id = generate_booking_id()

    # Check unique pairs
    while (car_id, booking_id) in used_pairs:
        booking_id = generate_booking_id()

    used_pairs.add((car_id, booking_id))
    booking_ids.append(booking_id)

# Add the BookingID column to the DataFrame
car_rental_df['BookingID'] = booking_ids

##### Car Rental Companies

In [40]:
# Since there are limited information and open dataset related to car rental companies
# we used the Faker library in Python to generate mock car rental company data in the code above

# Create temporary dataframe with unique company names
temp_company_df = pd.DataFrame(car_rental_df.CompanyName.unique(), columns=['CompanyName'])

# Add incrementing integers for CompanyID
temp_company_df.insert(0, 'CompanyID', range(1, 1 + len(temp_company_df)))

temp_company_df.head()

   CompanyID                       CompanyName
0          1                    Colon-Campbell
1          2       Sanchez, Miller and Proctor
2          3                   Anderson-Hughes
3          4                      Oliver-Allen
4          5  Aguilar, Underwood and Rodriguez

In [41]:
# Map CompanyID
company_id_list = [temp_company_df.CompanyID[temp_company_df.CompanyName == i].values[0] for i in car_rental_df.CompanyName]

# Add movie_id to the main dataframe
car_rental_df.insert(7, 'CompanyID', company_id_list)

In [42]:
car_rental_df.head()

,CarID,CarModel,CarManufacture,AutoTrans,PricePerDay,City,Country,CompanyID,CompanyName,PickUpDate,DropOffDate,BookingID
0,58905,Fusion,Ford,True,29.0,Iowa Falls,US,1,Colon-Campbell,2023-07-07,2023-07-16,13841
1,403202,718 Boxster,Porsche,True,162.0,Marshall,US,2,"Sanchez, Miller and Proctor",2023-07-11,2023-07-16,551
2,320436,Cruze,Chevrolet,True,40.0,Colliers,US,3,Anderson-Hughes,2023-08-03,2023-08-03,12765
3,350460,6 Series,BMW,True,99.0,Moon,US,4,Oliver-Allen,2023-07-31,2023-07-31,6653
4,429146,Explorer,Ford,True,81.0,Pittsburgh,US,5,"Aguilar, Underwood and Rodriguez",2023-07-09,2023-07-16,9934

##### Car Review Dataset

In [43]:
# We use car_review dataset for the car review table
car_review_df = pd.read_csv('car_review.csv', lineterminator='\n')
car_review_df.head()

,Unnamed: 0,Review_Date,Author_Name,Vehicle_Title,Review_Title,Review,Rating\r
0,0,on 10/13/05 15:30 PM (PDT),roadking,2002 Dodge Ram Cargo Van 1500 3dr Van (3.9L 6c...,Great delivery vehicle,It's been a great delivery vehicle for my caf...,4.625
1,1,on 07/17/05 21:59 PM (PDT),Mark,2002 Dodge Ram Cargo Van 3500 3dr Ext Van (5.2...,Disappointmnet,Bought this car as a commuter vehicle for a v...,2.125
2,2,on 07/16/02 00:00 AM (PDT),Tom Sheer,2002 Dodge Ram Cargo Van 3500 Maxi 3dr Ext Van...,Sweet van,"This van rocks its the best, lots of \rroom. ...",5.000
3,3,on 12/29/07 21:57 PM (PST),Keven Smith,2001 Dodge Ram Cargo Van 2500 Maxi 3dr Ext Van...,Keven Smith,Great work vehicle. Drives nice. has lots of ...,4.500
4,4,on 02/09/05 18:52 PM (PST),VanMan,2001 Dodge Ram Cargo Van 1500 3dr Van (3.9L 6c...,Not what Dodge used to be,Good solid frame and suspension. Well equipp...,2.875

In [44]:
# Check and drop NA
car_review_df = car_review_df.dropna()
car_review_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8499 entries, 0 to 8498
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     8499 non-null   int64
 1   Review_Date    8499 non-null   object
 2   Author_Name    8499 non-null   object
 3   Vehicle_Title  8499 non-null   object
 4   Review_Title   8499 non-null   object
 5   Review         8499 non-null   object
        8499 non-null   float64
dtypes: float64(1), int64(1), object(5)
memory usage: 464.9+ KB

In [45]:
# The ratings in the original dataset has 4 digits with 3 decimals.
# In the schema we designed, the ratings is implemented as numeric(2,1).
# We round the rating values to fit the designed format.

# Function to round to the nearest half-integer
def round_half_integer(number):
    return round(number * 2) / 2

# Applying the function to the DataFrame column
car_review_df['Rating'] = car_review_df['Rating\r'].apply(lambda x: round_half_integer(x))

In [46]:
# Since the dataset does not have UserID and CarID,
# we mock these columns by random values from the Users and CarInfo DataFrame
car_review_df['UserID'] = np.random.choice(users_df['UserID'], len(car_review_df))
car_review_df['CarID'] = np.random.choice(car_rental_df['CarID'], len(car_review_df))

# Add incrementing integers for ReviewID
car_review_df.insert(0, 'ReviewID', range(1, 1 + len(car_review_df)))

# Rename column
car_review_df.rename(columns={'Review': 'Comment'}, inplace=True)

# 1NF CarReview Dataframe
car_review_df.head()

,ReviewID,Unnamed: 0,Review_Date,Author_Name,Vehicle_Title,Review_Title,Comment,Rating\r,Rating,UserID,CarID
0,1,0,on 10/13/05 15:30 PM (PDT),roadking,2002 Dodge Ram Cargo Van 1500 3dr Van (3.9L 6c...,Great delivery vehicle,It's been a great delivery vehicle for my caf...,4.625,4.5,13609,268272
1,2,1,on 07/17/05 21:59 PM (PDT),Mark,2002 Dodge Ram Cargo Van 3500 3dr Ext Van (5.2...,Disappointmnet,Bought this car as a commuter vehicle for a v...,2.125,2.0,15554,404956
2,3,2,on 07/16/02 00:00 AM (PDT),Tom Sheer,2002 Dodge Ram Cargo Van 3500 Maxi 3dr Ext Van...,Sweet van,"This van rocks its the best, lots of \rroom. ...",5.000,5.0,11914,393715
3,4,3,on 12/29/07 21:57 PM (PST),Keven Smith,2001 Dodge Ram Cargo Van 2500 Maxi 3dr Ext Van...,Keven Smith,Great work vehicle. Drives nice. has lots of ...,4.500,4.5,17329,164126
4,5,4,on 02/09/05 18:52 PM (PST),VanMan,2001 Dodge Ram Cargo Van 1500 3dr Van (3.9L 6c...,Not what Dodge used to be,Good solid frame and suspension. Well equipp...,2.875,3.0,27520,278794

##### Car Rental Booking Payment Amount Dataset

In [47]:
# Calculate the total payment amount of each row
# Calculate the number of rental days
car_rental_df['RentalDays'] = (car_rental_df['DropOffDate'] - car_rental_df['PickUpDate']).dt.days + 1

# Add TotalAmount to the DataFrame
car_rental_df['TotalAmount'] = car_rental_df['PricePerDay'] * car_rental_df['RentalDays']

In [48]:
# Calculate the total payment amount of each BookingID
car_bookingid_total_df = car_rental_df.groupby('BookingID')['TotalAmount'].sum().reset_index()
car_bookingid_total_df.head()

   BookingID  TotalAmount
0          1       2105.0
1          2        260.0
2          3       2635.0
3          4        792.0
4          5       7859.0

### Part 2: Create database tables

In [49]:
# connection string
conn_url = 'postgresql://postgres:123@localhost/APAN5310_FinalProject'

# engine connecting to PostgreSQL server
engine = create_engine(conn_url)

# establish a connection
connection = engine.connect()

In [50]:
# SQL statement for creating tables
stmt = """
    CREATE TABLE users_info (
        "UserID" int PRIMARY KEY,
        "FirstName" varchar(50),
        "LastName" varchar(50),
        "Email" varchar(50),
        "Password" varchar(20),
        "Country" varchar(50),
        "PhoneNumber" varchar(15),
        "Address" varchar(150)
    );

    CREATE TABLE travel_groups (
        "GroupID" int,
        "UserID" int,
        PRIMARY KEY ("GroupID", "UserID"),
        FOREIGN KEY ("UserID") REFERENCES users_info("UserID")
    );

    CREATE TABLE payment_method (
        "PaymentMethodID" int PRIMARY KEY,
        "UserID" int,
        "CardNumber" varchar(20),
        "CardExpiry" date,
        "CardCVV" varchar(4),
        FOREIGN KEY ("UserID") REFERENCES users_info("UserID")
    );

    CREATE TABLE car_rental_companies (
        "CompanyID" int PRIMARY KEY,
        "CompanyName" varchar(150),
        "Country" varchar(50)
    );

    CREATE TABLE cars_info (
        "CarID" int PRIMARY KEY,
        "CompanyID" int,
        "CarModel" varchar(150),
        "CarManufacture" varchar(150),
        "AutoTrans" boolean,
        "PricePerDay" numeric(10, 2),
        FOREIGN KEY ("CompanyID") REFERENCES car_rental_companies("CompanyID")
    );

    CREATE TABLE hotels_info (
        "HotelID" int PRIMARY KEY,
        "HotelName" varchar(50),
        "City" varchar(50),
        "Country" varchar(50),
        "StarRating" int,
        "PricePerNight" numeric(12, 2)
    );

    CREATE TABLE hotel_room (
        "RoomID" int PRIMARY KEY,
        "HotelID" int,
        "RoomNumber" int,
        "RoomType" varchar(20),
        "Occupancy" int,
        "Floor" int,
        "Footprint" varchar(50),
        "Note" text,
        FOREIGN KEY ("HotelID") REFERENCES hotels_info("HotelID")
    );

    CREATE TABLE airline (
        "AirlineID" int PRIMARY KEY,
        "AirlineName" varchar(150),
        "Country" varchar(50)
    );

    CREATE TABLE airport (
        "AirportCode" char(3) PRIMARY KEY,
        "AirportName" varchar(150),
        "City" varchar(50),
        "Country" varchar(50)
    );

    CREATE TABLE aircraft (
        "AircraftID" char(3) PRIMARY KEY,
        "Model" varchar(150),
        "Capacity" int,
        "Manufacture" varchar(150)
    );

    CREATE TABLE class (
        "ClassID" char(1) PRIMARY KEY,
        "ClassName" varchar(25)
    );

    CREATE TABLE flight_info (
        "FlightID" int PRIMARY KEY,
        "AirlineID" int,
        "OriginAirportCode" char(3),
        "DestinationAirportCode" char(3),
        "AircraftID" char(3),
        "DepartureTime" timestamp,
        "ArrivalTime" timestamp,
        FOREIGN KEY ("AirlineID") REFERENCES airline("AirlineID"),
        FOREIGN KEY ("OriginAirportCode") REFERENCES airport("AirportCode"),
        FOREIGN KEY ("DestinationAirportCode") REFERENCES airport("AirportCode"),
        FOREIGN KEY ("AircraftID") REFERENCES aircraft("AircraftID")
    );

    CREATE TABLE seat (
        "SeatID" int PRIMARY KEY,
        "ClassID" char(1),
        "AircraftID" char(3),
        "Price" numeric(10, 2),
        "RowNumber" int,
        "SeatColumn" char(1),
        FOREIGN KEY ("ClassID") REFERENCES class("ClassID"),
        FOREIGN KEY ("AircraftID") REFERENCES aircraft("AircraftID")
    );

    CREATE TABLE bookings (
        "BookingID" int PRIMARY KEY,
        "UserID" int,
        "BookingDate" date,
        "TotalPrice" numeric(10, 2),
        FOREIGN KEY ("UserID") REFERENCES users_info("UserID")
    );

    CREATE TABLE car_rental_bookings (
        "BookingID" int,
        "CarID" int,
        "PickUpDate" date,
        "DropOffDate" date,
        PRIMARY KEY ("BookingID", "CarID"),
        FOREIGN KEY ("BookingID") REFERENCES bookings("BookingID"),
        FOREIGN KEY ("CarID") REFERENCES cars_info("CarID")
    );

    CREATE TABLE hotel_bookings (
        "BookingID" int,
        "RoomID" int,
        "CheckInDate" date,
        "CheckOutDate" date,
        PRIMARY KEY ("BookingID", "RoomID"),
        FOREIGN KEY ("BookingID") REFERENCES bookings("BookingID"),
        FOREIGN KEY ("RoomID") REFERENCES hotel_room("RoomID")
    );

    CREATE TABLE flight_bookings (
        "BookingID" int,
        "FlightID" int,
        "SeatID" int,
        PRIMARY KEY ("BookingID", "FlightID"),
        FOREIGN KEY ("BookingID") REFERENCES bookings("BookingID"),
        FOREIGN KEY ("FlightID") REFERENCES flight_info("FlightID"),
        FOREIGN KEY ("SeatID") REFERENCES seat("SeatID")
    );

    CREATE TABLE payments (
        "PaymentID" int PRIMARY KEY,
        "BookingID" int,
        "PaymentMethodID" int,
        "PaymentDate" date,
        "PaymentAmount" numeric(12, 2),
        FOREIGN KEY ("BookingID") REFERENCES bookings("BookingID"),
        FOREIGN KEY ("PaymentMethodID") REFERENCES payment_method("PaymentMethodID")
    );

    CREATE TABLE car_rental_reviews (
        "ReviewID" int PRIMARY KEY,
        "UserID" int,
        "CarID" int,
        "Rating" numeric(2,1),
        "Comment" text,
        FOREIGN KEY ("UserID") REFERENCES users_info("UserID"),
        FOREIGN KEY ("CarID") REFERENCES cars_info("CarID")
    );

    CREATE TABLE hotel_reviews (
        "ReviewID" int PRIMARY KEY,
        "UserID" int,
        "HotelID" int,
        "Rating" numeric(12,2),
        "Comment" text,
        FOREIGN KEY ("UserID") REFERENCES users_info("UserID"),
        FOREIGN KEY ("HotelID") REFERENCES hotels_info("HotelID")
    );

    CREATE TABLE flight_reviews (
        "ReviewID" int PRIMARY KEY,
        "FlightID" int,
        "UserID" int,
        "Rating" int,
        "Comment" text,
        FOREIGN KEY ("FlightID") REFERENCES flight_info("FlightID"),
        FOREIGN KEY ("UserID") REFERENCES users_info("UserID")
    );
"""

In [51]:
# execute the statement
connection.execute(stmt)

### Part 3: Load Data into Tables

In [52]:
# overview of users_df
users_df.head()

,UserID,FirstName,LastName,Email,Password,Country,PhoneNumber,Address,GroupID
0,1,Bailey,Stephens,pricerobert@example.com,zHSGAOwD(7,United States,(396) 147-2303,"027 Cantu Lodge Apt. 091, Bakermouth, NV 42652",1
1,2,Kenneth,Harrison,ystrong@example.com,YxkU*P(^$3,United States,(165) 906-5753,"139 Murray Stravenue Apt. 584, Cherrymouth, SD...",2
2,3,Amber,Flores,tiffany82@example.net,c1R2AaPE)v,United States,(411) 310-5021,"9028 Edwards Crest Apt. 722, Chavezbury, WV 14147",2
3,4,Lynn,Anderson,donnagilmore@example.com,84JQrwX($d,United States,(935) 933-0904,"Unit 1545 Box 1487, DPO AE 32598",3
4,5,Bruce,Davidson,cheryljackson@example.net,$(Y9Tt6o5B,United States,(086) 155-3472,"206 Cohen Burg Suite 294, Mckeefurt, TN 27447",3

In [54]:
# Load data into the UsersInfo table
users_df[['UserID', 'FirstName', 'LastName', 'Email', 'Password', 'Country', 'PhoneNumber', 'Address']].to_sql(name='users_info', con=connection, if_exists='append', index=False)

1000

In [55]:
# Load data into the TravelGroups table
users_df[['GroupID', 'UserID']].to_sql(name='travel_groups', con=connection, if_exists='append', index=False)

1000

In [56]:
# overview of payment_method_df
payment_method_df.head()

   PaymentMethodID  UserID           CardNumber  CardExpiry CardCVV
0                1       1     3508833699632845  2024-07-18     456
1                2       2  4724988873995674147  2021-09-07     554
2                3       3     4365164050500953  2023-11-07     586
3                4       4  4896828489824650487  2022-05-10     581
4                5       5  4807817602046284964  2023-03-26     375

In [57]:
# Load data into the PaymentMethod table
payment_method_df[['PaymentMethodID', 'UserID', 'CardNumber', 'CardExpiry', 'CardCVV']].to_sql(name='payment_method', con=connection, if_exists='append', index=False)

1000

In [58]:
# overview of car_rental_df
car_rental_df.head()

,CarID,CarModel,CarManufacture,AutoTrans,PricePerDay,City,Country,CompanyID,CompanyName,PickUpDate,DropOffDate,BookingID,RentalDays,TotalAmount
0,58905,Fusion,Ford,True,29.0,Iowa Falls,US,1,Colon-Campbell,2023-07-07,2023-07-16,13841,10,290.0
1,403202,718 Boxster,Porsche,True,162.0,Marshall,US,2,"Sanchez, Miller and Proctor",2023-07-11,2023-07-16,551,6,972.0
2,320436,Cruze,Chevrolet,True,40.0,Colliers,US,3,Anderson-Hughes,2023-08-03,2023-08-03,12765,1,40.0
3,350460,6 Series,BMW,True,99.0,Moon,US,4,Oliver-Allen,2023-07-31,2023-07-31,6653,1,99.0
4,429146,Explorer,Ford,True,81.0,Pittsburgh,US,5,"Aguilar, Underwood and Rodriguez",2023-07-09,2023-07-16,9934,8,648.0

In [60]:
# Load data into the CarRentalCompanies table
car_rental_df[['CompanyID', 'CompanyName', 'Country']].drop_duplicates().to_sql(name='car_rental_companies', con=connection, if_exists='append', index=False)

251

In [61]:
# Load data into the CarsInfo table
car_rental_df[['CarID', 'CompanyID', 'CarModel', 'CarManufacture', 'AutoTrans' ,'PricePerDay']].drop_duplicates(subset=['CarID']).to_sql(name = 'cars_info', con=connection, if_exists='append', index=False)

784

In [62]:
# overview of hotels_info_df
hotels_info_df.head()

,HotelID,HotelName,City,Country,StarRating,PricePerNight
0,886,Vasquez-Lambert,North Kathleenborough,KWT,3,451
1,451,"Burns, Bryant and Zimmerman",Greerland,MLI,2,472
2,572,Campos and Sons,Michaelhaven,DNK,1,423
3,790,Jones-Freeman,East Karen,BIH,1,99
4,984,Roach-Tucker,North Vincent,MCO,4,311

In [63]:
# Load data into the HotelsInfo table
hotels_info_df[['HotelID', 'HotelName', 'City', 'Country', 'StarRating', 'PricePerNight']].to_sql(name='hotels_info', con=connection, if_exists='append', index=False)

1000

In [64]:
# overview of hotel_room_df
hotel_room_df.head()

,RoomID,HotelID,RoomNumber,Occupancy,Floor,RoomType,Footprint,Note
0,1,755,1706,1,17,Single,345,Plan lot own nor. Above simple certain more by...
1,2,589,1614,0,16,Suite,828,However determine any his read ready security....
2,3,379,2905,1,29,Double,778,When head world common knowledge certainly ind...
3,4,363,703,1,7,Suite,710,College group heart all fly ability. Beyond gi...
4,5,563,711,0,7,Single,795,Fall recent note act claim. Sign rate chair in...

In [65]:
# Load data into the HotelRoom table
hotel_room_df[['RoomID', 'HotelID', 'RoomNumber', 'RoomType', 'Occupancy', 'Floor', 'Footprint', 'Note']].to_sql(name='hotel_room', con=connection, if_exists='append', index=False)

1000

In [66]:
# overview of airline_df
airline_df.head()

,AirlineID,Name,Alias,IATA,ICAO,Callsign,Country,Active
2,2,135 Airways,<NA>,NaN,GNL,GENERAL,United States,N
3,3,1Time Airline,<NA>,1T,RNX,NEXTIME,South Africa,Y
4,4,2 Sqn No 1 Elementary Flying Training School,<NA>,NaN,WYT,NaN,United Kingdom,N
5,5,213 Flight Unit,<NA>,NaN,TFU,NaN,Russia,N
6,6,223 Flight Unit State Airline,<NA>,NaN,CHD,CHKALOVSK-AVIA,Russia,N

In [67]:
# Load data into the Airline table
airline_df = airline_df.rename(columns={
    'Name': 'AirlineName'
})

airline_df[['AirlineID', 'AirlineName', 'Country']].to_sql(name='airline', con=connection, if_exists='append', index=False)

144

In [68]:
# overview of airline_df
airport_df.head()

,AirportID,Name,City,Country,IATA,ICAO,Latitude,Longitude,Altitude,Timezone,DST,Tz database time zone,Type,Source
0,1,Goroka Airport,Goroka,Papua New Guinea,GKA,AYGA,-6.081690,145.391998,5282,10,U,Pacific/Port_Moresby,airport,OurAirports
1,2,Madang Airport,Madang,Papua New Guinea,MAG,AYMD,-5.207080,145.789001,20,10,U,Pacific/Port_Moresby,airport,OurAirports
2,3,Mount Hagen Kagamuga Airport,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826790,144.296005,5388,10,U,Pacific/Port_Moresby,airport,OurAirports
3,4,Nadzab Airport,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569803,146.725977,239,10,U,Pacific/Port_Moresby,airport,OurAirports
4,5,Port Moresby Jacksons International Airport,Port Moresby,Papua New Guinea,POM,AYPY,-9.443380,147.220001,146,10,U,Pacific/Port_Moresby,airport,OurAirports

In [69]:
# Load data into the Airport table
airport_df = airport_df.rename(columns={
    'IATA': 'AirportCode',
    'Name': 'AirportName'
})

airport_df[['AirportCode', 'AirportName', 'City', 'Country']].to_sql(name='airport', con=connection, if_exists='append', index=False)

33

In [70]:
# overview of plane_df
plane_df.head()

,Name,IATA,ICAO,Manufacturer,Model,Capacity
0,Aerospatiale (Nord) 262,ND2,N262,Aerospatiale,(Nord) 262,186
1,Aerospatiale (Sud Aviation) Se.210 Caravelle,CRV,S210,Aerospatiale,(Sud Aviation) Se.210 Caravelle,92
2,Aerospatiale SN.601 Corvette,NDC,S601,Aerospatiale,SN.601 Corvette,249
3,Aerospatiale/Alenia ATR 42-300,AT4,AT43,Aerospatiale/Alenia,ATR 42-300,177
4,Aerospatiale/Alenia ATR 42-500,AT5,AT45,Aerospatiale/Alenia,ATR 42-500,259

In [71]:
# Load data into the Aircraft table
plane_df = plane_df.rename(columns={
    'IATA': 'AircraftID',
    'Manufacturer': 'Manufacture'
})

plane_df[['AircraftID', 'Model', 'Capacity', 'Manufacture']].drop_duplicates(subset=['AircraftID']).to_sql(name='aircraft', con=connection, if_exists='append', index=False)

220

In [72]:
# overview of class_df
class_df.head()

   ClassID        ClassName
0        1    Economy Class
1        2   Business Class
2        3  Premium Economy
3        4      First Class

In [73]:
# Load data into the Class table
class_df[['ClassID', 'ClassName']].to_sql(name='class', con=connection, if_exists='append', index=False)

4

In [74]:
# overview of flight_info_df
flight_info_df.head()

,FlightID,AirlineID,OriginAirportCode,DestinationAirportCode,AircraftID,DepartureTime,ArrivalTime
0,1,751,DYU,DBV,320,2023-07-31 12:56:02,2023-07-31 15:42:22
1,2,3437,ARN,ORD,333,2023-06-05 16:50:22,2023-06-06 07:27:13
2,3,1889,LPB,OGG,295,2022-10-30 17:50:23,2022-10-31 04:20:31
3,4,4936,BSB,EMA,SH6,2022-08-19 02:27:38,2022-08-19 08:44:29
4,5,4091,CAE,KOO,74J,2022-10-14 15:46:07,2022-10-15 04:51:51

In [76]:
# Load data into the FlightInfo table

# all valid airport codes
valid_airport_codes = pd.read_sql('SELECT "AirportCode" FROM airport', con=connection)['AirportCode']

# filter df with only rows with valid origin and destination airport codes
filtered_flight_info_df = flight_info_df[
    flight_info_df['OriginAirportCode'].isin(valid_airport_codes) &
    flight_info_df['DestinationAirportCode'].isin(valid_airport_codes)
]

filtered_flight_info_df[['FlightID', 'AirlineID', 'OriginAirportCode', 'DestinationAirportCode', 'AircraftID', 'DepartureTime', 'ArrivalTime']].to_sql(name='flight_info', con=connection, if_exists='append', index=False)

742

In [77]:
# overview of seat_df
seat_df.head()

   SeatID  ClassID AircraftID   Price  RowNumber SeatColumn
0       1        2        IL6  303.81         19          G
1       2        2        PL6  452.13         15          H
2       3        2        E7W  346.17         25          K
3       4        2        E7W  156.46         30          F
4       5        1        AR1  361.83          6          H

In [78]:
# Load data into the Seat table
seat_df[['SeatID', 'ClassID', 'AircraftID', 'Price', 'RowNumber', 'SeatColumn']].drop_duplicates(subset=['SeatID']).to_sql(name='seat', con=connection, if_exists='append', index=False)

725

In [80]:
# Merge the df on BookingID
bookings_df = bookings_df.copy()
bookings_df = bookings_df.merge(flight_bookingid_total_df, on='BookingID', how='left', suffixes=('', '_flight'))
bookings_df = bookings_df.merge(hotel_bookingid_total_df, on='BookingID', how='left', suffixes=('', '_hotel'))
bookings_df = bookings_df.merge(car_bookingid_total_df, on='BookingID', how='left', suffixes=('', '_car'))
bookings_df

# Fill missing values with 0 (no flight/hotel/car rental in this booking)
bookings_df['TotalAmount'].fillna(0, inplace=True)
bookings_df['TotalAmount_hotel'].fillna(0, inplace=True)
bookings_df['TotalAmount_car'].fillna(0, inplace=True)

# Total price
bookings_df['TotalPrice'] = bookings_df['TotalAmount'] + bookings_df['TotalAmount_hotel'] + bookings_df['TotalAmount_car']


bookings_df.drop(columns=['TotalAmount', 'TotalAmount_hotel', 'TotalAmount_car'], inplace=True)
bookings_df.head()

   BookingID  UserID BookingDate  TotalPrice
0          1    8226  2022-08-17     2562.96
1          2   10795  2023-01-17      932.78
2          3    9164  2023-05-31     3188.80
3          4   26592  2022-09-10     1800.00
4          5    6632  2022-09-04    21679.69

In [81]:
# Load data into the Bookings table
bookings_df[['BookingID', 'UserID', 'BookingDate', 'TotalPrice']].to_sql(name='bookings', con=connection, if_exists='append', index=False)

951

In [82]:
# overview of car_rental_df
car_rental_df.head()

,CarID,CarModel,CarManufacture,AutoTrans,PricePerDay,City,Country,CompanyID,CompanyName,PickUpDate,DropOffDate,BookingID,RentalDays,TotalAmount
0,58905,Fusion,Ford,True,29.0,Iowa Falls,US,1,Colon-Campbell,2023-07-07,2023-07-16,13841,10,290.0
1,403202,718 Boxster,Porsche,True,162.0,Marshall,US,2,"Sanchez, Miller and Proctor",2023-07-11,2023-07-16,551,6,972.0
2,320436,Cruze,Chevrolet,True,40.0,Colliers,US,3,Anderson-Hughes,2023-08-03,2023-08-03,12765,1,40.0
3,350460,6 Series,BMW,True,99.0,Moon,US,4,Oliver-Allen,2023-07-31,2023-07-31,6653,1,99.0
4,429146,Explorer,Ford,True,81.0,Pittsburgh,US,5,"Aguilar, Underwood and Rodriguez",2023-07-09,2023-07-16,9934,8,648.0

In [83]:
# Load data into the CarRentalBookings table
car_rental_df[['BookingID', 'CarID', 'PickUpDate','DropOffDate']].to_sql(name='car_rental_bookings', con=connection, if_exists='append', index=False)

279

In [85]:
# overview of hotel_bookings_df
hotel_bookings_df.tail()

       BookingID  RoomID CheckOutDate CheckInDate
14995       7189    5986   2015-07-28  2015-07-15
14996       3693    7773   2015-09-10  2015-09-03
14997       1830   19570   2015-09-19  2015-09-03
14998      19719    2477   2015-09-05  2015-09-03
14999       1046    8082   2015-09-08  2015-09-03

In [86]:
# Load data into the HotelBookings table
hotel_bookings_df[['BookingID', 'RoomID', 'CheckInDate', 'CheckOutDate']].to_sql(name='hotel_bookings', con=connection, if_exists='append', index=False)

1000

In [87]:
# overview of flight_bookings_df
flight_bookings_df.head()

   BookingID  FlightID  SeatID
0      13903     14061    2654
1      17403      5393     239
2      12909     19774   11657
3       9649     19907    3610
4      12214      1143    6746

In [88]:
# Load data into the FlightBookings table
# all valid FlightID
valid_flight_ids = pd.read_sql('SELECT "FlightID" FROM flight_info', con=connection)['FlightID']

# filter df with only rows with valid FlightID
flight_bookings_df = flight_bookings_df[flight_bookings_df['FlightID'].isin(valid_flight_ids)]

flight_bookings_df[['BookingID', 'FlightID', 'SeatID']].to_sql(name='flight_bookings', con=connection, if_exists='append', index=False)

861

In [90]:
# Add PaymentAmount column to payments_df
payments_df = payments_df.merge(bookings_df[['BookingID', 'TotalPrice']], on='BookingID', how='left')
payments_df.rename(columns={'TotalPrice': 'PaymentAmount'}, inplace=True)
payments_df.head()

   PaymentID  BookingID  PaymentMethodID PaymentDate  PaymentAmount
0          1          1             8226  2022-10-29        2562.96
1          2          2            10795  2022-08-31         932.78
2          3          3             9164  2022-09-30        3188.80
3          4          4            26592  2023-05-12        1800.00
4          5          5             6632  2023-06-17       21679.69

In [91]:
# Load data into the Payments table
payments_df[['PaymentID', 'BookingID', 'PaymentMethodID', 'PaymentDate', 'PaymentAmount']].to_sql(name='payments', con=connection, if_exists='append', index=False)

951

In [92]:
# overview of car_review_df
car_review_df.head()

,ReviewID,Unnamed: 0,Review_Date,Author_Name,Vehicle_Title,Review_Title,Comment,Rating\r,Rating,UserID,CarID
0,1,0,on 10/13/05 15:30 PM (PDT),roadking,2002 Dodge Ram Cargo Van 1500 3dr Van (3.9L 6c...,Great delivery vehicle,It's been a great delivery vehicle for my caf...,4.625,4.5,13609,268272
1,2,1,on 07/17/05 21:59 PM (PDT),Mark,2002 Dodge Ram Cargo Van 3500 3dr Ext Van (5.2...,Disappointmnet,Bought this car as a commuter vehicle for a v...,2.125,2.0,15554,404956
2,3,2,on 07/16/02 00:00 AM (PDT),Tom Sheer,2002 Dodge Ram Cargo Van 3500 Maxi 3dr Ext Van...,Sweet van,"This van rocks its the best, lots of \rroom. ...",5.000,5.0,11914,393715
3,4,3,on 12/29/07 21:57 PM (PST),Keven Smith,2001 Dodge Ram Cargo Van 2500 Maxi 3dr Ext Van...,Keven Smith,Great work vehicle. Drives nice. has lots of ...,4.500,4.5,17329,164126
4,5,4,on 02/09/05 18:52 PM (PST),VanMan,2001 Dodge Ram Cargo Van 1500 3dr Van (3.9L 6c...,Not what Dodge used to be,Good solid frame and suspension. Well equipp...,2.875,3.0,27520,278794

In [93]:
# Load data into the CarRentalReviews table
car_review_df[['ReviewID', 'UserID', 'CarID', 'Rating', 'Comment']].to_sql(name='car_rental_reviews', con=connection, if_exists='append', index=False)

499

In [94]:
# overview of hotel_reviews_df
hotel_reviews_df.head()

,ReviewID,UserID,HotelID,Rating,Comment
0,1,19157,381,4,nice hotel expensive parking got good deal sta...
1,2,13700,859,2,ok nothing special charge diamond member hilto...
2,3,3804,698,3,nice rooms not 4* experience hotel monaco seat...
3,4,24786,519,5,"unique, great stay, wonderful time hotel monac..."
4,5,24662,768,5,"great stay great stay, went seahawk game aweso..."

In [95]:
# Load data into the HotelReviews table
hotel_reviews_df[['ReviewID', 'UserID', 'HotelID', 'Rating', 'Comment']].to_sql(name='hotel_reviews', con=connection, if_exists='append', index=False)

491

In [96]:
# overview of flight_reviews_df
flight_reviews_df.head()

,ReviewID,FlightID,UserID,Rating,Comment
1,1,2969,12698,7.0,First time Iâ€™d flown TK. I found them very ...
3,2,3897,10682,2.0,"We make our check in in the airport, they Tak..."
5,3,923,29098,3.0,I flew with this company several times in the...
7,4,1129,616,10.0,Turkish Airlines has consistently maintained ...
9,5,3829,19892,1.0,Never book Turkish airlines if you are travel...

In [97]:
# Load data into the FlightReviews table
# all valid FlightID
valid_flight_ids = pd.read_sql('SELECT "FlightID" FROM flight_info', con=connection)['FlightID']

# ilter df with only rows with valid FlightID
filtered_flight_reviews_df = flight_reviews_df[flight_reviews_df['FlightID'].isin(valid_flight_ids)]

filtered_flight_reviews_df[['ReviewID', 'FlightID', 'UserID', 'Rating', 'Comment']].to_sql(name='flight_reviews', con=connection, if_exists='append', index=False)

353